In [29]:
import numpy as np
import pandas as pd

In [30]:
df=pd.read_csv(r"data.csv")
df

    Experience  Salary   Age
0            3   20000  27.0
1            4   28000  30.0
2            1   15000  38.0
3            8   40000  45.0
4            7   40000  33.0
5           10   50000   NaN
6           12   51000   NaN
7            2    9000  27.0
8           16   61000  40.0
9           21   98000  55.0
10          20   96000  50.0
11           4   27000  40.0
12           5   30000  51.0
13          16   60000   NaN
14          17   65000   NaN
15          25   99000  57.0
16          18   65000   NaN
17           6   31000  32.0
18           2   21000  30.0
19           8    3600  32.0

In [31]:
df.isnull().sum()

Experience    0
Salary        0
Age           5
dtype: int64

In [32]:
df.sample(10)

    Experience  Salary   Age
8           16   61000  40.0
1            4   28000  30.0
14          17   65000   NaN
16          18   65000   NaN
13          16   60000   NaN
0            3   20000  27.0
7            2    9000  27.0
18           2   21000  30.0
17           6   31000  32.0
2            1   15000  38.0

In [34]:
df.shape# 20 rows 3 columns

(20, 3)

In [ ]:
#test data-separate null values from the data

In [38]:
test_data=df[df["Age"].isnull()]
test_data

    Experience  Salary  Age
5           10   50000  NaN
6           12   51000  NaN
13          16   60000  NaN
14          17   65000  NaN
16          18   65000  NaN

In [39]:
#Drop the null values from the dataframe and take it as train dataset

In [40]:
df.dropna(inplace=True)

In [41]:
df.isnull().sum()

Experience    0
Salary        0
Age           0
dtype: int64

In [59]:
#x train except the age column
x_train=df.drop("Age",axis=1)
x_train

    Experience  Salary
0            3   20000
1            4   28000
2            1   15000
3            8   40000
4            7   40000
7            2    9000
8           16   61000
9           21   98000
10          20   96000
11           4   27000
12           5   30000
15          25   99000
17           6   31000
18           2   21000
19           8    3600

In [ ]:
#3.create X_train,y_train from dataframe

In [60]:
y_train=df["Age"]#non null values

In [61]:
y_train

0     27.0
1     30.0
2     38.0
3     45.0
4     33.0
7     27.0
8     40.0
9     55.0
10    50.0
11    40.0
12    51.0
15    57.0
17    32.0
18    30.0
19    32.0
Name: Age, dtype: float64

In [62]:
y_train.size

15

In [63]:
y_train.shape

(15,)

In [64]:
#Build model predicting the missing value in column age

In [65]:
from sklearn.linear_model import LinearRegression
lr=LinearRegression()
lr.fit(x_train,y_train)

LinearRegression()

In [66]:
#6.create the x_test from the test_data

In [68]:
x_test=test_data.drop("Age",axis=1)
x_test

    Experience  Salary
5           10   50000
6           12   51000
13          16   60000
14          17   65000
16          18   65000

In [69]:
#apply the model on x_test and predicting the missing values
y_predict=lr.predict(x_test)

In [70]:
y_predict

array([41.24550026, 41.79026866, 44.41131787, 45.66824576, 45.83123622])

In [71]:
#7.replace the missing value with predicted values
#replace missing value with predicted values
test_data.loc[test_data.Age.isnull(),"Age"]=y_predict

C:\Users\sameer\anaconda3\lib\site-packages\pandas\core\indexing.py:1745: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  isetter(ilocs[0], value)

In [72]:
test_data

    Experience  Salary        Age
5           10   50000  41.245500
6           12   51000  41.790269
13          16   60000  44.411318
14          17   65000  45.668246
16          18   65000  45.831236